# Importación de nuestros datos

In [8]:
import pandas as pd

Especifica mente el DataSet que vamos a utilizar su separador es `;` por lo tanto a la hora de abrirlo tendremos que especificarlo.

In [9]:
url = ("https://gist.githubusercontent.com/ahcamachod/a572cfcc2527046db93101f88011b26e/raw/ffb13f45a79d31223e645611a119397dd127ee3c/alquiler.csv")
df = pd.read_csv(url,sep=';')

Confirmamos que se haya cargado correctamente mostrando las primeras 5 filas del DataFrame.

In [10]:
df.head(5)

,Tipo,Colonia,Habitaciones,Garages,Suites,Area,Valor,Condominio,Impuesto
0,Cocineta,Condesa,1,0,0,40,5950.0,1750.0,210.0
1,Casa,Polanco,2,0,1,100,24500.0,NaN,NaN
2,Conjunto Comercial/Sala,Santa Fe,0,4,0,150,18200.0,14070.0,3888.5
3,Departamento,Centro Histórico,1,0,0,15,2800.0,1365.0,70.0
4,Departamento,Del Valle,1,0,0,48,2800.0,805.0,NaN

Ahora, una tarea que se nos asigno fue saber la cantidad de registros que tenemos en nuestra base de datos, para ello utilizaremos el atributo `shape` del DataFrame.

In [11]:
print('La cantidad de filas y columnas es:',df.shape)

La cantidad de filas y columnas es: (25121, 9)

Tambien necesitamos conocer los nombres de las columnas que tenemos en nuestro DataFrame.

In [12]:
print('Las columnas son: ',df.columns.tolist())

Las columnas son:  ['Tipo', 'Colonia', 'Habitaciones', 'Garages', 'Suites', 'Area', 'Valor', 'Condominio', 'Impuesto']

## **Exploración inicial de los datos**

In [16]:
df.sample(5)

,Tipo,Colonia,Habitaciones,Garages,Suites,Area,Valor,Condominio,Impuesto
23108,Departamento,Juárez,2,0,0,84,9275.0,3010.0,556.5
5804,Conjunto Comercial/Sala,Centro Histórico,0,18,0,2964,1258712.0,269727.5,NaN
3362,Departamento,Álvaro Obregón,2,0,0,60,2380.0,693.0,NaN
20160,Departamento,Roma,2,1,1,50,18900.0,NaN,NaN
23252,Cocineta,Condesa,1,0,0,29,4550.0,3570.0,NaN

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25121 entries, 0 to 25120
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Tipo          25121 non-null  object
 1   Colonia       25121 non-null  object
 2   Habitaciones  25121 non-null  int64
 3   Garages       25121 non-null  int64
 4   Suites        25121 non-null  int64
 5   Area          25121 non-null  int64
 6   Valor         25107 non-null  float64
 7   Condominio    22495 non-null  float64
 8   Impuesto      18037 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.7+ MB

In [19]:
df['Tipo']

0                       Cocineta
1                           Casa
2        Conjunto Comercial/Sala
3                   Departamento
4                   Departamento
                  ...
25116    Cochera/Estacionamiento
25117                   Cocineta
25118               Departamento
25119               Departamento
25120    Conjunto Comercial/Sala
Name: Tipo, Length: 25121, dtype: object

In [21]:
df[['Tipo','Valor']]

                          Tipo    Valor
0                     Cocineta   5950.0
1                         Casa  24500.0
2      Conjunto Comercial/Sala  18200.0
3                 Departamento   2800.0
4                 Departamento   2800.0
...                        ...      ...
25116  Cochera/Estacionamiento  49000.0
25117                 Cocineta   2800.0
25118             Departamento   4900.0
25119             Departamento  10500.0
25120  Conjunto Comercial/Sala  22750.0

[25121 rows x 2 columns]